Repository: LuighiV/automate-insert-image
Catalog: editdocuments/Strings.*.resx
Languages: es

# ExecutionCompletedDefaultMessage
source: Execution ended in all selected files.
es: La ejecución del programa finalizó en todos los archivos seleccionados.

# ExecutionCompletedTitle
source: Execution completed
es: Ejecución completada

# ExecutionErrorTitle
source: Execution error
es: Error de ejecución

# HelpBottomLeft
source: Set the page reference to the bottom left corner of the selected page.
es: Establece la referencia de la página a la esquina inferior izquierda de la página seleccionada.

# HelpBottomRight
source: Set the page reference to the bottom right corner of the selected page.
es: Establece la referencia de la página a la esquina inferior derecha de la página seleccionada.

# HelpCurrentUnit
source: Current unit for Width, Height, LeftOffset and BottomOffset. If changed, all values are updated to its equivalence.
es: Unidad actual para el Ancho, Alto, Desplazamiento desde la izquierda y Desplzamiento desde la derecha. Si se modifica, todos los valores se actualizan de acuerdo con su equivalencia.

# HelpGenerate
source: Click to insert the image in selected files and save resulting documents as PDFs.
es: Clic para insertar la imagen en los archivos seleccionados y guardar el resultado como PDFs.

# HelpImageBottomOffset
source: Distance from the reference point to the bottom side of the image. Measured in the selected unit.
es: Distancia desde el punto de referencia al lado inferior de la imagen. Medido en la unidad seleccionada.

# HelpImageHeight
source: Current image height in the selected unit.
es: Alto de imagen actual en unidad de medida seleccionada.

# HelpImageLeftOffset
source: Distance from the reference point to the left side of the image. Measured in the selected unit.
es: Distancia desde el punto de referencia al lado izquierdo de la imagen. Medido en la unidad seleccionada.

# HelpImagePreview
source: Image preview for current selected picture.
es: Vista previa de la imagen actual.

# HelpImageWidth
source: Current image width in the selected unit.
es: Ancho de imagen actual en unidad de medida seleccionada.

# HelpInputPath
source: Current input file/folder path. Click on "Explore" to select one.
es: Dirección de documento(s)/carpeta de entrada. Clic en "Explorar" para seleccionar alguno.

# HelpInputPathExplore
source: Click to select the files/folder to be processed.
es: Clic para seleccionar documento(s)/carpeta a ser procesado.

# HelpInputPathFiles
source: Set the input path as a list of files, separated by commas ","
es: Establece la dirección de entrada como una lista de archivos, separados por comas ","

# HelpInputPathFolder
source: Set the input path as a folder.
es: Establece la dirección de entrada como carpeta.

# HelpKeepAspectRatio
source: Mantain the aspect ratio for the image. If modify width, the height is modified accordingly.
es: Mantiene la relación de aspecto de la imagen. Si se modifica el ancho, el alto cambia automáticamente.

# HelpPageNumber
source: Page number where the image is inserted.
es: Número de página donde se insertará la imagen.

# HelpPDFSelection
source: Select PDF as input document type.
es: Selecciona PDF como tipo de documento de entrada.

# HelpPicturePath
source: Current picture path. Click on "Explore" to select one.
es: Dirección de imagen actual. Clic en "Explorar" para seleccionar alguna.

# HelpPicturePathExplore
source: Click to select the picture to be inserted in document(s).
es: Clic para seleccionar la imagen a ser insertada en documento(s).

# HelpPlaceHolder
source: Text to be searched in document and where the image will be placed.
es: Texto a ser buscado en documento y donde se insertará la imagen.

# HelpRelativeToPage
source: Set the reference to the corners in the page. Only for PDF documents.
es: Establece la referencia a las esquinas de la página. Solo para documentos PDF.

# HelpRelativeToText
source: Set the reference to a text placeholder in the document.
es: Establece la referencia al texto del marcador de posición en el documento.

# HelpSameFolder
source: Save the PDF in the same folder as the original file. Only for Word documents.
es: Guarda el PDF en la misma carpeta que el archivo original. Solo para documentos de Word.

# HelpSubFolder
source: Save the PDF in a subfolder relative to the directory of the current file.
es: Guarda el PDF en una subcarpeta relativa al directorio del archivo actual.

# HelpSubFolderText
source: Set the subfolder name to save the generated PDF file.
es: Establece el nombre de la carpeta para guardar el archivo PDF generado.

# HelpTopLeft
source: Set the page reference to the top left corner of the selected page.
es: Establece la referencia de la página a la esquina superior izquierda de la página seleccionada.

# HelpTopRight
source: Set the page reference to the top right corner of the selected page.
es: Establece la referencia de la página a la esquina superior derecha de la página seleccionada.

# HelpWordSelection
source: Select Word as input document type.
es: Selecciona Word como tipo de documento de entrada.

# InfoCloseWord
source: Closing MS Word in background
es: Cerrando MS Word en segundo plano

# InfoCounterFile
source: File {0} /{1}
es: Archivo {0} /{1}

# InfoCreateDirectorySuccess
source: The directory {0} was created sucessfully at {1}
es: El directorio {0} fue creado correctamente en {1}

# InfoFileName
source: Current file name: {0}
es: Nombre de archivo actual: {0}

# InfoFinishFile
source: Finish processing file {0}
es: Procesamiento finalizado de archivo {0}

# InfoFinishProcessingFiles
source: Finish processing files.
es: Procesamiento de archivos finalizado.

# InfoFinishProgram
source: Finish program
es: Programa finalizado

# InfoOpenWord
source: Starting MS Word in background
es: Iniciando MS Word en segundo plano

# InfoPageOutOfBounds
source: Page {0} is out of the document bounds. Image not inserted.
es: Página {0} fuera de los límites del documento. Imagen no insertada.

# InfoPlaceholder
source: Placeholder set to: {0}
es: Marcador de posicion en: {0}

# InfoSavedPDFFile
source: Saved PDF file: {0}
es: Archivo PDF guardado: {0}

# InfoSaveWordDocument
source: Save word document: {0}
es: Guardar archivo Word: {0}

# InfoStartFile
source: Processsing file: {0}
es: Procesando archivo: {0}

# InfoStartProcessingFiles
source: Starting processing {0} files.
es: Iniciando procesamiento de {0} archivos.

# InfoStartProgram
source: Starting program
es: Iniciando programa

# InfoStatusFileExplorerOpen
source: File explorer opened.
es: Explorador de archivos abierto.

# InfoStatusFolderExplorerOpen
source: Folder explorer opened.
es: Explorador de carpetas abierto.

# InfoStatusNewDialogProcessing
source: The processing is executing in another dialog.
es: El procesamiento se está ejecutando en otro cuadro de diálogo.

# InfoStatusProcessingFinished
source: The processing has finished.
es: El procesamiento ha finalizado.

# InfoStatusReady
source: Ready
es: Preparado

# InfoStatusStartProcessing
source: The processing has started.
es: El procesamiento ha iniciado.

# InfoStatusValidationError
source: Some validations were not successful. Please, check the blinking alerts and fix them.
es: Algunas validaciones no fueron exitosas. Por favor, verifique las alertas y corríjalas.

# InfoSummarySuccess
source: Total documents with inserted image successfully: {0}/{1}
es: Total de documentos con imagen insertada satisfactoriamente: {0}/{1}

# InfoTextNotFound
source: Text "{0}" not found in document. Image not inserted.
es: Texto "{0}" no encontrado en documento. Imagen no insertada.

# InfoYes
source: yes
es: sí

# QuerySaveCurrentValues
source: Would you like to save the current settings?
es: ¿Le gustaría guardar la configuración actual?

# SaveCurrentValues
source: Save current settings
es: Guardar configuración actual

# TextValidationFilePath
source: It is required a valid file path. Use the Explorer button to select one.
es: Se requiere un archivo válido. Use el botón Explorar para seleccionar uno.

# TextValidationPicturePath
source: It is required a valid picture path. Use the Explorer button to select one.
es: Se require una figura válida. Use el botón Explorar para seleccionar una.

# TextValidationPlaceholder
source: It is required a non-empty placeholder.
es: Se require un marcador de posición no vacío.

# TextValidationSubFolder
source: It is required a non-empty subfolder name.
es: Se require un nombre de subcarpeta no vacío.

# TitleAbout
source: About
es: Acerca de

# TitleHowToUse
source: How to use
es: Cómo usar
